# Cleaning Data Exercises

In this exercise, we'll be returning to the American Community Survey data we used previously to measuring racial income inequality in the United States. In today's exercise, we'll be using it to measure the returns to education and how those returns vary by race and gender.

<span style="color: #008080">*Jiechen Li*</span>


## Gradescope Autograding

Please follow [all standard guidance](https://www.practicaldatascience.org/html/autograder_guidelines.html) for submitting this assignment to the Gradescope autograder, including storing your solutions in a dictionary called `results` and ensuring your notebook runs from the start to completion without any errors.

For this assignment, please name your file `exercise_missing.ipynb` before uploading.

You can check that you have answers for all questions in your `results` dictionary with this code:

```python
assert set(results.keys()) == {
    "ex5_age_young",
    "ex5_age_old",
    "ex7_avg_age",
    "ex8_avg_age",
    "ex9_num_college",
    "ex11_share_male_w_degrees",
    "ex11_share_female_w_degrees",
    "ex12_comparing",
}
```


### Submission Limits

Please remember that you are **only allowed three submissions to the autograder.** Your last submission (if you submit 3 or fewer times), or your third submission (if you submit more than 3 times) will determine your grade Submissions that error out will **not** count against this total.

## Exercises

### Exercise 1

For these cleaning exercises, we'll return to the ACS data we've used before one last time. We'll be working with `US_ACS_2017_10pct_sample.dta`. Import the data (please use url for the autograder).

In [3]:
import pandas as pd

pd.set_option("mode.copy_on_write", True)

acs = pd.read_stata(
    "https://github.com/nickeubank/MIDS_Data/raw/master/US_AmericanCommunitySurvey/US_ACS_2017_10pct_sample.dta"
)

print("Loading the American Community Survey data from URL:")
acs.head()

Loading the American Community Survey data from URL:

,year,datanum,serial,cbserial,numprec,subsamp,hhwt,hhtype,cluster,adjust,...,migcounty1,migmet131,vetdisab,diffrem,diffphys,diffmob,diffcare,diffsens,diffeye,diffhear
0,2017,1,177686,2.017001e+12,9,64,55,"female householder, no husband present",2.017002e+12,1.011189,...,0,not in identifiable area,n/a,n/a,n/a,n/a,n/a,no vision or hearing difficulty,no,no
1,2017,1,1200045,2.017001e+12,6,79,25,"male householder, no wife present",2.017012e+12,1.011189,...,0,not in identifiable area,n/a,no cognitive difficulty,no ambulatory difficulty,no independent living difficulty,no,no vision or hearing difficulty,no,no
2,2017,1,70831,2.017000e+12,1 person record,36,57,"male householder, living alone",2.017001e+12,1.011189,...,0,not in identifiable area,n/a,has cognitive difficulty,no ambulatory difficulty,no independent living difficulty,no,no vision or hearing difficulty,no,no
3,2017,1,557128,2.017001e+12,2,10,98,married-couple family household,2.017006e+12,1.011189,...,0,not in identifiable area,n/a,no cognitive difficulty,no ambulatory difficulty,no independent living difficulty,no,no vision or hearing difficulty,no,no
4,2017,1,614890,2.017001e+12,4,96,54,married-couple family household,2.017006e+12,1.011189,...,0,not in identifiable area,n/a,n/a,n/a,n/a,n/a,no vision or hearing difficulty,no,no

### Exercise 2

For our exercises today, we'll focus on `age`, `sex`, `educ` (education), and `inctot` (total income). Subset your data to those variables, and quickly look at a sample of 10 rows.

In [4]:
col = ["age", "sex", "educ", "inctot"]
subset_acs = acs[col]
sample = subset_acs.sample(10)

print("Sample of 10 rows from ACS subset:")
sample

Sample of 10 rows from ACS subset:

       age     sex                 educ   inctot
305354  25  female             grade 12    30000
292038  12  female  grade 5, 6, 7, or 8  9999999
49439   49  female    1 year of college    21000
260848  52    male             grade 12     6300
11841   54    male             grade 12    50900
260005  20    male             grade 12     1000
173286  63  female   4 years of college    22000
6401    21    male             grade 12    30000
148449  24  female    1 year of college    25500
82252   31    male    1 year of college    75000

### Exercise 3

As before, all the values of `9999999` have the potential to cause us real problems, so replace all the values of `inctot` that are `9999999` with `np.nan`.

In [5]:
import numpy as np

subset_acs.loc[subset_acs["inctot"] == 9999999, "inctot"] = np.nan

print("Replace 9999999 with NaN in the subset:")

subset_acs["inctot"]

Replace 9999999 with NaN in the subset:

0              NaN
1           6000.0
2           6150.0
3          14000.0
4              NaN
            ...
318999     22130.0
319000         NaN
319001      5000.0
319002    240000.0
319003     48000.0
Name: inctot, Length: 319004, dtype: float64

### Exercise 4

Attempt to calculate the average age of people in our data. What do you get? Why are you getting that error?

You *should* get an error in trying to answer this question, but **PLEASE LEAVE THE CODE THAT GENERATES THIS ERROR COMMENTED OUT SO YOUR NOTEBOOK WILL RUN IN THE AUTOGRADER**. 

Then talk about the error in a markdown cell.

In [6]:
# average_age = subset_acs["age"].mean()

<span style="color: #008080">I have "TypeError: 'Categorical' with dtype category does not support reduction 'mean'" error when I tried to calculate the average age value. 

<span style="color: #008080">The reason for this error could be:

<span style="color: #008080">1. The age column might contain non-numeric values or string values.    

<span style="color: #008080">2. The column might contain missing values (NaN) that can interfere with calculations.     

<span style="color: #008080">3. There could be some unexpected data types or corrupted data in the age column.</span>

### Exercise 5

We want to be able to calculate things using age, so we need it to be a numeric type. Check the current type of `age`, and look at all the values of `age` to figure out why it's categorical and not numeric. You should find two problematic categories. Store the values of these categories in `"ex5_age_young"` and `"ex5_age_old"` (once you find them, it should be clear which is which).

In [7]:
age_type = subset_acs["age"].dtype

print(acs.age.describe())
print(age_type)

count     319004
unique        97
top           60
freq        4950
Name: age, dtype: object
category

In [8]:
subset_acs["age"].dtypes

results = {}

results["ex5_age_young"] = "less than 1 year old"
results["ex5_age_old"] = "90 (90+ in 1980 and 1990)"

print(
    f"By listing the values in the 'age' column, I find two problematic categories:, \none is 'less than 1 year old',"
    "the other one is '90 (90+ in 1980 and 1990)'."
)

By listing the values in the 'age' column, I find two problematic categories:,
one is 'less than 1 year old',the other one is '90 (90+ in 1980 and 1990)'.

### Exercise 6

In order to convert `age` into a numeric variable, we need to replace those problematic entries with values that `pandas` can later convert into numbers. Pick appropriate substitutions for the existing values and replace the current values. 

**Hint 1:** Categorical variables act like strings, so you might want to use string methods! 

**Hint 2:** Remember that characters like parentheses, pluses, asterisks, etc. are special in Python strings, and you have to escape them if you want them to be interpreted literally!

**Hint 3:** Because the US Census has been conducted regularly for hundreds of years but exactly how the census has been conducted have occasionally changed, variables are sometimes coded in a way that might be interpreted in different ways for different census years. For example, hypothetically, one might write `90 (90+ in 1980 and 1990)` if the Censuses conducted in 1980 and 1990 used to top-code age at 90 (any values *over* 90 were just coded as 90), but more recent Censuses no longer top-coded age and recorded ages over 90 as the respondents actual age.

In [9]:
subset_acs.loc[:, "age"] = subset_acs["age"].replace("less than 1 year old", "0")
subset_acs.loc[:, "age"] = subset_acs["age"].replace("90 (90+ in 1980 and 1990)", "90")
subset_acs.loc[:, "age"] = pd.to_numeric(subset_acs["age"])
subset_acs["age"]
# subset_acs_copy = subset_acs.copy()

# subset_acs_copy["age"] = subset_acs_copy["age"].astype(str)
# subset_acs_copy.loc[subset_acs_copy["age"] == "less than 1 year old", "age"] = 0
# subset_acs_copy.loc[subset_acs_copy["age"] == "90 (90+ in 1980 and 1990)", "age"] = 90

# is_numeric_boolean = subset_acs_copy["age"].str.isnumeric()
# subset_acs_copy.loc[is_numeric_boolean, "age"] = subset_acs_copy.loc[is_numeric_boolean, "age"].astype(int)
# subset_acs_copy.loc[~is_numeric_boolean, 'age'] = None


print(
    "I replaced the two problematic ages to string entries, then converted the numeric string entries to integers, \nand converted non-numeric entries to NaN."
)
subset_acs

I replaced the two problematic ages to string entries, then converted the numeric string entries to integers,
and converted non-numeric entries to NaN.

        age     sex                       educ    inctot
0         4  female  nursery school to grade 4       NaN
1        17  female                   grade 11    6000.0
2        63    male         4 years of college    6150.0
3        66  female                   grade 12   14000.0
4         1    male        n/a or no schooling       NaN
...     ...     ...                        ...       ...
318999   33  female         4 years of college   22130.0
319000    4  female  nursery school to grade 4       NaN
319001   20    male                   grade 12    5000.0
319002   47    male        5+ years of college  240000.0
319003   33    male        5+ years of college   48000.0

[319004 rows x 4 columns]

### Exercise 7

Now convert age from a categorical to numeric. Calculate the average age amoung this group, and store it in `"ex7_avg_age"`.

In [10]:
ex7_avg_age = subset_acs["age"].mean()
results["ex7_avg_age"] = ex7_avg_age

print(f"The average age amoung this group is about {round(ex7_avg_age):,}.")

The average age amoung this group is about 41.

### Exercise 8

Let's now filter out anyone in our data whose age is less than 18. Note that before made `age` a numeric variable, we couldn't do this! Again, calculate the average age and this time store it in `"ex8_avg_age"`. 

Use this sample of people 18 and over for all subsequent exercises.

In [11]:
subset_acs_over_18 = subset_acs[subset_acs["age"] >= 18]

ex8_avg_age = subset_acs_over_18["age"].mean()
results["ex8_avg_age"] = ex8_avg_age

print(f"The average age amoung this group is about {round(ex8_avg_age):,}.")

The average age amoung this group is about 50.

### Exercise 9

Create an indicator variable for whether each person has *at least* a college Bachelor's degree called `college_degree`. Use this variable to calculate the number of people in the dataset with a college degree. You may assume that to get a college degree you need to complete at least 4 years of college. Save the result as `"ex9_num_college"`.

In [14]:
subset_acs_over_18["college_degree"] = (
    subset_acs_over_18["educ"] == "4 years of college"
) | (subset_acs_over_18["educ"] == "5+ years of college")

ex9_num_college = subset_acs_over_18["college_degree"].sum()
results["ex9_num_college"] = ex9_num_college

print(
    f"The total number of people who have at least a college degree is {(ex9_num_college):,}."
)

The total number of people who have at least a college degree is 77,013.

### Exercise 10

Let's examine how the educational gender gap. Use `pd.crosstab` to create a cross-tabulation of `sex` and `college_degree`. `pd.crosstab` will give you the number of people who have each combination of `sex` and `college_degree` (so in this case, it will give us a 2x2 table with Male and Female as rows, and `college_degree` True and False as columns, or vice versa.

In [16]:
educational_gender_gap = pd.crosstab(
    subset_acs_over_18["sex"], subset_acs_over_18["college_degree"]
)

print(
    f"The total number of male who have a college degree is 99963 and female is 105859."
)

educational_gender_gap

The total number of male who have a college degree is 99963 and female is 105859.

college_degree  False  True
sex
male            85821  36181
female          90200  40832

### Exercise 11

Counts are kind of hard to interpret. `pd.crosstab` can also normalize values to give percentages. Look at the `pd.crosstab` help file to figure out how to normalize the values in the table. Normalize them so that you get the share of men with and without college degree, and the share of women with and without college degrees.

Store the share (between 0 and 1) of men with college degrees in `"ex11_share_male_w_degrees"`, and the share of women with degrees in `"ex11_share_female_w_degrees"`.

In [17]:
subset_acs_over_18["sex"].unique()

['male', 'female', NaN]
Categories (2, object): ['male' < 'female']

In [18]:
normalized_gender_gap = pd.crosstab(
    subset_acs_over_18["sex"], subset_acs_over_18["college_degree"], normalize="index"
)

ex11_share_male_w_degrees = normalized_gender_gap.loc["male", True]
ex11_share_female_w_degrees = normalized_gender_gap.loc["female", True]

results["ex11_share_male_w_degrees"] = ex11_share_male_w_degrees
results["ex11_share_female_w_degrees"] = ex11_share_female_w_degrees

print(
    f"The percentages of male who have a college degree is about 18.0% and female is about 19.2%."
)
print(ex11_share_male_w_degrees)
print(ex11_share_female_w_degrees)

The percentages of male who have a college degree is about 18.0% and female is about 19.2%.
0.29656071211947344
0.3116185359301545

### Exercise 12

Now, let's recreate that table for people who are 40 and over and people under 40. Over time, what does this suggest about the absolute difference in the share of men and women earning college degrees? Has it gotten larger, stayed the same, or gotten smaller? Store your answer (either `"the absolute difference has increased"` or `"the absolute difference has decreased"`) in `"ex12_comparing"`.

In [19]:
# subset_acs["age"] = subset_acs["age"].astype(int)

table = pd.crosstab(
    subset_acs_over_18.sex,
    [subset_acs_over_18["age"] >= 40, subset_acs_over_18.college_degree],
    normalize="index",
)

results["ex12_comparing"] = "the absolute difference has increased"

print(
    f"The table shows the absolute difference of male and female who are over 40 \nand have college degress has increased."
)
table

The table shows the absolute difference of male and female who are over 40
and have college degress has increased.

age                False               True
college_degree     False     True      False     True
sex
male            0.259602  0.089728  0.443837  0.206833
female          0.214291  0.107607  0.474090  0.204011

### Exercise 13

In words, what is causing the change noted in Exercise 12 (i.e., looking at the tables above, tell me a story about Men and Women's College attainment).

<span style="color: #008080">From the data, we can derive the following insights:

<span style="color: #008080">1. Increased College Attainment Over Time: Both men and women under 40 have a lower percentage of individuals with college degrees than those 40 and over. This suggests that college attainment has increased over time for both genders.

<span style="color: #008080">2. Gender Gap in College Attainment is Decreasing: Among those 40 and over, a slightly higher percentage of women have college degrees than men. In contrast, for those under 40, the percentage of women with degrees is closer to the percentage of men with degrees. This suggests that the gender gap in college attainment has decreased over time.

<span style="color: #008080">3. Higher Proportion of Young People Without Degrees: The percentage of young people (under 40) without degrees is higher than that of older people (40 and over) for both genders. However, this doesn't necessarily mean younger generations are less educated. It could be because many in the under-40 group are still in the process of completing their education.

<span style="color: #008080">In summary, while college attainment has generally increased over time for both men and women, the gender gap in college attainment appears to be narrowing, with women slightly outpacing men in recent generations.

## Check Results

In [20]:
results

{'ex5_age_young': 'less than 1 year old',
 'ex5_age_old': '90 (90+ in 1980 and 1990)',
 'ex7_avg_age': 41.30384885455982,
 'ex8_avg_age': 49.75769659413359,
 'ex9_num_college': 77013,
 'ex11_share_male_w_degrees': 0.29656071211947344,
 'ex11_share_female_w_degrees': 0.3116185359301545,
 'ex12_comparing': 'the absolute difference has increased'}

In [ ]:
assert set(results.keys()) == {
    "ex5_age_young",
    "ex5_age_old",
    "ex7_avg_age",
    "ex8_avg_age",
    "ex9_num_college",
    "ex11_share_male_w_degrees",
    "ex11_share_female_w_degrees",
    "ex12_comparing",
}

## Want More Practice?

Calculate the educational racial gap in the United States for White Americans, Black Americans, Hispanic Americans, and other groups. 

Note that to do these calculations, you'll have to deal with the fact that unlike most Americans, the American Census Bureau treats "Hispanic" not as a racial category, but a linguistic one. As a result, the racial category "White" in `race` actually includes most Hispanic Americans. For this analysis, we wish to work with the mutually exclusive categories of "White, non-Hispanic", "White, Hispanic", "Black (Hispanic or non-Hispanic)", and a category for everyone else.